## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/48598159/runs/9ab70c70-e48b-4268-860d-6a5f78a71b68).

> [!IMPORTANT]
> Gates added to the change.

| Token   | Directory | Workspace | Required Approvers           | Any Approvers | Any Remaining Count |
|---------|-----------|-----------|------------------------------|----------------|----------------------|
| create-instance | `.` | `default` |  | `team:sre`  | 1 |

<details>
    <summary>
        Expand for details on gates
    </summary>
    
### What to do?

To continue, users matching the `Required Approvers` and `Any Approvers` must approve a token until all approvals are satisfied.

To approve a token, comment the following:

```
terrateam gate approve <token>
```

Where `<token>` is the token to be approved.

#### How Gatekeeper requirements work

Gatekeeper uses `all_of`, `any_of`, and `any_of_count` to define approval rules:

- `all_of` - Lists users or groups that must approve unconditionally.
- `any_of` - Lists users or groups that may approve.
- `any_of_count` - Sets how many approvals are required from the `any_of` list.

A gate is satisfied only when all conditions are met. See [documentation](https://docs.terrateam.io/advanced-workflows/gatekeeper-requirements) for details.
</details>

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
**Command**: `terraform plan -detailed-exitcode -out /tmp/tmpmcpjb40b/plan`
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_instance.ec2_instance will be created
+   resource "aws_instance" "ec2_instance" {
+       ami                                  = "ami-04e914639d0cca79a"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags_all                             = (known after apply)
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
**Step**: conftest
**Success**: :heavy_multiplication_x:
**Command**: `conftest test --ignore .git -o json /tmp/tmpx4_r4udy/conftest.plan.json`
```

[
	{
		"filename": "/tmp/tmpx4_r4udy/conftest.plan.json",
		"namespace": "main",
		"successes": 0,
		"failures": [
			{
				"msg": "Creating instances with invalid instance type: aws_instance.ec2_instance",
				"metadata": {
					"query": "data.main.deny"
				}
			}
		]
	}
]

```

</details>

## Cost Estimation
**Total Monthly Difference: 9.27 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 9.27 | 9.27|
| | **Total** | **0.00** | **9.27** | **9.27** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
